class CollegeOfEducationalScience {
  final String image;
  final String title;
  final String education;
  final String email;
  final String about;
  final String phone;

  CollegeOfEducationalScience({
    required this.phone,
    required this.image,
    required this.title,
    required this.education,
    required this.email,
    required this.about,
  });
}

final softDocs = [
  CollegeOfEducationalScience(
    phone: '398',
    image: 'assets/images/Educational Sciences/khaledalmomaniedu.jpg',
    title: 'د.خالد المومني',
    education: 'إدارة تربوية',
    email: 'd.khaledmomani@yahoo.com',
    about:
        'خالد المومني، رئيس قسم الادارة التربوية حاصل على دكتوراه وماجستير في إدارة تربوية من جامعة اليرموك، لديه خبرة تدريسية في جامعات الأردن والسعودية، متخصص في مهارات التعلم والاتصال والتفكير.',
  ),
  CollegeOfEducationalScience(
    phone: '372',
    image: 'assets/images/anu.jpg',
    title: 'د.يسرى الخصاونة',
    education: 'الأصول التربوية',
    email: 'yusra_khasawneh@yahoo.com',
    about:
        'يسرى خصاونة، حاصلة على درجة الدكتوراه في التربية من جامعة اليرموك، تعمل كإدارية تربوية خبيرة في وزارة التربية والتعليم الأردنية. لديها مجموعة من المؤهلات العلمية من جامعة اليرموك، بما في ذلك درجة الماجستير والبكالوريوس في اللغة العربية والتربية، ودرجة الدكتوراه في الأصول التربوية.',
  ),
  CollegeOfEducationalScience(
    phone: 'لا يوجد',
    image: 'assets/images/Educational Sciences/amjaddradkh1.png',
    title: 'د.أمجد درادكة',
    education: 'إدارة تربوية',
    email: 'amdaradkah@ yahoo.com',
    about:
        'أمجد محمود محمد درادكة، أستاذ مشارك في إدارة التربية، حاصل على درجة الدكتوراه في إدارة التربية والماجستير في نفس التخصص من جامعة اليرموك في الأردن، ودرجة البكالوريوس في الشريعة من جامعة جرش. يمتلك خبرة تدريسية في جامعات الأردن والسعودية، بما في ذلك جامعة الملك خالد وجامعة الطائف في السعودية، وجامعة الشرق الأوسط وجامعة عجلون الوطنية في الأردن.',
  ),
  CollegeOfEducationalScience(
    phone: '382',
    image: 'assets/images/anu.jpg',
    title: 'د.بثينة عويس',
    education: ' ادارة تربوية',
    email: '',
    about: '',
  ),
  CollegeOfEducationalScience(
    phone: 'لا يوجد',
    image: 'assets/images/Educational Sciences/dr.mohamedalsadi.jpg',
    title: 'د.محمد السعدي',
    education: 'إدارة تربوية',
    email: 'malside@yahoo.com',
    about:
        'د. محمود محمود السعدي، حاصل على درجة الدكتوراه في إدارة التربية من جامعة اليرموك عام 2020، متخصص في تقنيات التعليم الحديثة والتعميم الإلكتروني. حاصل أيضًا على درجة الماجستير في إدارة التربية من جامعة اليرموك، ودرجة البكالوريوس في إدارة المدارس من جامعة فيلادلفيا. يتمتع بخبرة في التدريس كمحاضر غير متفرغ في جامعة عجلون الوطنية.',
  ),
  CollegeOfEducationalScience(
    phone: 'لا يوجد',
    image: 'assets/images/Educational Sciences/mosaabuzaiton.png',
    title: 'د.موسى ابو زيتون',
    education: 'إرشاد نفسي وتربوي',
    email: '',
    about:
        'موسى سليمان الصالح أبو زيتون، حاصل على دكتوراه في إرشاد نفسي وتربوي من جامعة عمان العربية، وماجستير في إرشاد وتوجيه من جامعة اليرموك، وبكالوريوس في علوم الإدارة من جامعة اليرموك أيضًا. لديه خبرة في الإرشاد التربوي منذ عام 1989، شغل منصب رئيس قسم الإرشاد التربوي في مديرية التربية والتعليم لمحافظة جرش، ويعمل حاليًا كأخصائي نفسي في دار تربية وتأهيل الأحداث في اربد.',
  ),
  CollegeOfEducationalScience(
    phone: '305',
    image: 'assets/images/Educational Sciences/rabialzgoul.jpg',
    title: 'ربيع الزغول',
    education: 'تربية خاصة',
    email: 'rabie_alzghoul@hotmail.com',
    about:
        'رابي حامد حسن الزغول، ولديه درجة الماجستير في علم النفس التوجيهي من جامعة اليرموك بتقدير جيد جداً، ويعمل كعضو هيئة تدريس في قسم علم النفس التوجيهي بجامعة عجلون الوطنية منذ أكتوبر ٢٠١٢. كما لديه خبرة لمدة ستة أشهر كمستشار مهني في مؤسسة الأميرة نورة بنت عبدالله بمخيم الزعتري في محافظة المفرق.',
  ),
  CollegeOfEducationalScience(
    phone: 'لا يوجد',
    image: 'assets/images/anu.jpg',
    title: 'د.ريم الكناني',
    education: 'التربية الخاصة',
    email: 'reem_k2000@yahoo.com',
    about:
        'د. ريم عبد الله محمد الكناني، أستاذ مشارك في تخصص التربية الخاصة وأستاذ مشارك في مجال الإرشاد النفسي والصحة النفسية. حاصلة على درجة الدكتوراه في التربية الخاصة من جامعة عمان العربية، ومعادلة شهادة الدكتوراه في دولة الإمارات العربية المتحدة. تتمتع بخبرة تدريسية وإدارية طويلة، حيث عملت كأستاذ مساعد في عدة جامعات في الأردن والسعودية، وقامت بالعمل كأخصائية في مجال التربية الخاصة والموجه في الإمارات.',
  ),
  CollegeOfEducationalScience(
    phone: 'لا يوجد',
    image: 'assets/images/Educational Sciences/saleh_dradkah.png',
    title: 'د.صالح عليان درادكة',
    education: 'إرشاد نفسي',
    email: 'Salehxp7@hotmail.com',
    about:
        'د. صالح عليان أحمد درادكة، حاصل على درجة الدكتوراه في علم النفس والإرشاد من جامعة اليرموك بتقدير جيد، وعلى درجة الماجستير في علم النفس والإرشاد من الجامعة نفسها بتقدير جيد جدًا، وعلى درجة البكالوريوس في التربية الخاصة من جامعة اليرموك بتقدير جيد. لديه خبرة في الإرشاد والتوجيه النفسي، حيث عمل كمرشد نفسي في مؤسسات تعليمية وصحية في الأردن والسعودية.',
  ),
  CollegeOfEducationalScience(
    phone: '318',
    image: 'assets/images/anu.jpg',
    title: 'د.رابحة القضاة',
    education: 'قياس وتقويم',
    email: 'rabha_qudah@yahoo.comالبريد',
    about:
        'رابحة عدنان علي القضاة، رئيس قسم التربية الخاصة حاصلة على ماجستير في القياس والتقويم التربوي وبكالوريوس في تخصص معلم صف، ولديها شهادة ثانوية عامة بتقدير ممتاز. تمتلك خبرة كسكرتيرة ورئيسة ديوان رئاسة جامعة عجلون الوطنية. تتمتع بمهارات في التحرير الصحفي والتعامل مع وسائل الإعلام.',
  ),
  CollegeOfEducationalScience(
    phone: '363',
    image: 'assets/images/Educational Sciences/fesalnwasrah.png',
    title: 'أ.د. فيصل النواصره',
    education: 'تربية خاصة',
    email: 'nawasrehf@yahoo.com',
    about:
        'فيصل عيسى عبد القادر النواصرة، حاصل على بكالوريوس في تخصص معلم مجال علوم عامة، وماجستير ودكتوراه في التربية الخاصة من جامعة عمان العربية للدراسات العليا بتقدير ممتاز. يعمل كأستاذ مساعد في التربية الخاصة في جامعة عجلون الوطنية منذ عام 2013، ولديه خبرة تزيد عن 20 عامًا كمعلم في وزارة التربية والتعليم الأردنية.',
  ),
  CollegeOfEducationalScience(
    phone: 'لا يوجد',
    image: 'assets/images/anu.jpg',
    title: 'أ.د. الهام القصيرين',
    education: 'تربية خاصة',
    email: 'dr.alham_2013@yahoo.com',
    about:
        'الهام مصطفى حوران القصيرين، حاصلة على بكالوريوس وماجستير في التربية، ودكتوراة في التربية الخاصة حول TEACCH. لديها خبرة تدريسية كمساعد في جامعة عجلون الوطنية وجامعة الملك عبد العزيز، كما عملت كمديرة لمركز تطوير أعضاء هيئة التدريس بجامعة عجلون.',
  ),
  CollegeOfEducationalScience(
    phone: '377',
    image: 'assets/images/Educational Sciences/dr.brhan.jpg',
    title: 'أ.د.برهان حمادنة',
    education: 'التربية خاصة',
    email: 'b.hamadneh@anu.edu.jo',
    about:
        'برهان حمود حمادنة، يعمل حاليًا كأستاذ وبروفيسور في كلية العلوم التربوية بجامعة عجلون الوطنية. حاصل على دكتوراه في التربية الخاصة من جامعة العلوم الإسلامية العالمية في عام 2012، وعلى ماجستير في الموهبة والإبداع من جامعة البلقاء التطبيقية في عام 2009، وعلى بكالوريوس في التربية من جامعة اليرموك في عام 2004. له خبرة واسعة في التدريس والبحث العلمي في مجال التربية الخاصة، حيث عمل كأستاذ وبروفيسور في جامعة نجران بالمملكة العربية السعودية. يشتمل نشاطه الأكاديمي على التدريس في مجموعة متنوعة من برامج التعليم العالي، بالإضافة إلى الإشراف على الرسائل العلمية والمشاريع البحثية والمشاركة في الأنشطة الأكاديمية والإدارية.',
  ),
  CollegeOfEducationalScience(
    phone: 'لا يوجد',
    image: 'assets/images/Educational Sciences/khaledebedat.png',
    title: 'د.خالد احمد عبيدات',
    education: 'التربية الخاصة',
    email: 'k.obeidat@yahoo.com',
    about:
        'خالد أمحد طه عبيدات، حاصل على درجة الدكتوراه في التربية الخاصة من جامعة السلطان زين العابدين في ماليزيا بتقدير ممتاز في عام 2020، وعلى درجة الماجستير في التربية الخاصة من جامعة عمان العربية في الأردن بتقدير ممتاز في عام 2015، وعلى درجة البكالوريوس في إدارة الأعمال من جامعة إربد الأهلية في الأردن في عام 2010. يعمل حاليًا كأستاذ مساعد في جامعة عجلون الوطنية في الأردن. اهتماماته البحثية الحالية تركز بشكل أساسي على الأطفال ذوي اضطراب طيف التوحد (ASD) وأطفال ذوي صعوبات التعلم وتعديل السلوك. لديه خبرة في التدريس والبحث العلمي، وحضر العديد من المؤتمرات الدولية ونشر العديد من المقالات العلمية الدولية. كما أنه مدرب معتمد من بريطانيا.',
  ),
  CollegeOfEducationalScience(
    phone: '305',
    image: 'assets/images/Educational Sciences/mohamedalomarita.jpg',
    title: 'م.محمد العمري',
    education: 'التربية الخاصة',
    email: 'dahleh.omari@gmail.com',
    about:
        'د. محمد العمري خبير تعليمي في مجال التربية الخاصة، حاصل على درجة الدكتوراه في التربية الفنية من جامعة الأردن عام 2010، ودرجة الماجستير في التربية الخاصة من نفس الجامعة عام 2006، ودرجة البكالوريوس في التربية الخاصة أيضًا من جامعة الأردن عام 2001. يشغل حاليًا منصب رئيس قسم في جامعة عجلون الوطنية في الأردن، وقد عمل سابقًا كنائب رئيس قسم التربية الخاصة في جامعة الأمير سطام بن عبد العزيز بالخرج، وكمحاضر مساعد في نفس الجامعة ورئيس قسم التربية الخاصة والإرشاد النفسي في جامعة عجلون الوطنية، وأستاذ مساعد في جامعة الملك عبد العزيز بجدة، السعودية.',
  ),
  CollegeOfEducationalScience(
    phone: '395',
    image: 'assets/images/Educational Sciences/nayafalwahshah.png',
    title: 'د نايف علي وحشة',
    education: 'تربية خاصة',
    email: 'wahshehnayef@yahoo.com',
    about:
        'نايف علي نايف وحشه، حاصل على درجة الدكتوراه في تخصص التربية الخاصة من جامعة جنان في لبنان عام 2015 بتقدير ممتاز، وحاصل أيضًا على درجة الماجستير في التربية الخاصة من جامعة عمان العربية عام 2011 بتقدير ممتاز، ودرجة البكالوريوس في الجغرافيا من جامعة اليرموك عام 2009 بتقدير جيد جدًا، ودبلوم عالي في التربية من جامعة عمان العربية عام 2006 بتقدير ممتاز، ودرجة البكالوريوس في اللغة الإنجليزية وآدابها من جامعة الهاشمية عام 2003 بتقدير مقبول, يعمل حاليًا كأستاذ مساعد في جامعة عجلون الوطنية منذ تاريخ 1 / 10 / 2015.',
  ),
];
