class CollegeOfLiterature {
  final String image;
  final String title;
  final String education;
  final String email;
  final String about;
  final String phone;

  CollegeOfLiterature({
    required this.phone,
    required this.image,
    required this.title,
    required this.education,
    required this.email,
    required this.about,
  });
}

final softDocs = [
  CollegeOfLiterature(
    phone: '+962772674974',
    image: 'assets/images/Literature/AliKharabsheh.jpg',
    title: 'أ.د. علي الخرابشة',
    education: 'أدب ونقد',
    email: 'aligassem85@yahoo.com',
    about:
        'د. علي قاسم محمد الخرابشة، أستاذ مشارك ورئيس قسم اللغة العربية في جامعة عجلون الوطنية. حاصل على دكتوراه في الأدب والنقد الحديث. لديه خبرة تدريسية في جامعات مختلفة ويتمتع بخبرة في البحث العلمي حول الشعر الحديث.',
  ),
  CollegeOfLiterature(
    phone: '',
    image: 'assets/images/Literature/mansouralyasreh.png',
    title: 'د. منصور العياصرة',
    education: 'اللغة والنحو',
    email: '',
    about:
        'أ.د. منصور حسين العياصرة, عميد كلة الآداب والعلوم التربوية في جامعة عجلون الوطنية حاصل على دكتوراه في الغه والنحو لديه خبرة تدريسية في جامعات مختلفة شارك في العديد من المؤتمرات اللغوية والأدبية.',
  ),
  CollegeOfLiterature(
    phone: '+962796609960',
    image: 'assets/images/anu.jpg',
    title: 'أ. د. ياسين أبو الهيجا',
    education: 'اللغة والنحو',
    email: 'yaaseeno2@yahoo.com',
    about:
        'الأستاذ ياسين محمد ياسين أبو الهيجاء، حاصل على بكالوريوس وماجستير في اللغة والنحو من جامعة اليرموك، ودكتوراه في اللغة والنحو أيضًا من نفس الجامعة. أجرى أطروحتين تحت إشراف أ.د. فوزي الشايب. له خبرة تدريسية في عدة جامعات في الأردن والسعودية، حيث عمل كأستاذ مساعد في جامعة الإسراء وجامعة أم القرى، ثم تقدم في الرتبة ليصبح أستاذًا مشاركًا في جامعة أم القرى. حاليًا يعمل كأستاذ في جامعة عجلون الوطنية بالأردن منذ عام 2022. يقوم بتدريس مراحل البكالوريوس والدراسات العليا في مجالات النحو والصرف واللغويات التطبيقية.',
  ),
  CollegeOfLiterature(
    phone: '',
    image: 'assets/images/Literature/abedalrahemmarashdeh.jpeg',
    title: 'أ. د. عبد الرحيم المراشدة',
    education: 'أدب ونقد',
    email: '',
    about:
        'د. عبد الرحيم عزام مراشدة، عمره 69 عامًا، من إربد، الأردن. درّس الأدب والنقد في جامعة اليرموك وحصل على دكتوراه في الأدب الحديث في عام 2001. بدأ مسيرته الأكاديمية في جامعة جرش وانتقل إلى جامعة جدارا حيث ترقى ليصبح أستاذًا. في عام 2020، أصبح عميدًا للبحث العلمي والدراسات العليا في جامعة عجلون الوطنية. خارج الجامعة، شغل مناصب إدارية في المجال الثقافي وشارك في تأسيس بيوت ثقافية ومجلات.',
  ),
  CollegeOfLiterature(
    phone: '+962799661590',
    image: 'assets/images/anu.jpg',
    title: 'د. أمل ملكاوي',
    education: 'أدب ونقد',
    email: 'amal.malkawi1212@gmail.com',
    about:
        'أمل مالكاوي، محاضر سابق في جامعة حائل السعودية. حاصلة على ماجستير في آداب الأدب والنقد من جامعة اليرموك، وبكالوريس في اللغة العربية من جامعة آل البيت. خبرة في التدريس والعمل الصحفي.',
  ),
  CollegeOfLiterature(
    phone: '+962775745758',
    image: 'assets/images/Literature/muhanedaljabali.jpg',
    title: 'د.مهند الجبالي',
    education: 'النقد والبلاغة',
    email: 'dr.mohandjabali@gmail.com',
    about:
        'مهند حسن حمد الجبالي، عضو هيئة تدريس في كلية الآداب بجامعة عجلون الوطنية. حاصل على درجة الدكتوراه في علم اللغة، ودكتوراه في نمذجة اللغة من جامعتي السودان ودمشق بتقدير ممتاز. له خبرة تدريسية واسعة في مجال تعليم اللغة العربية. كما ألّف وبحث في عدة مواضيع لغوية مختلفة.',
  ),
  CollegeOfLiterature(
    phone: '+962772207979',
    image: 'assets/images/Literature/zuheraloroud.jpg',
    title: 'د. زهير العرود',
    education: 'اللغة والنحو',
    email: '',
    about:
        'زهير محمد عقاب العرود، رئيس قسم اللغة العربية في جامعة عجلون الوطنية، لديه درجات علمية في اللغة والنحو بتقدير ممتاز، ويعمل في التدريس والإدارة الأكاديمية منذ فترة طويلة. يدرس مواد مختلفة في اللغة العربية والأدب، ويشارك في العديد من اللجان الجامعية. قام بدورات تدريبية في التدريس والإشراف التربوي.',
  ),
  CollegeOfLiterature(
    phone: '+962779513113',
    image: 'assets/images/Literature/sameralzubi.jpg',
    title: 'د. سامر الزعبي',
    education: 'اللغويات',
    email: 'samer.alzoubi@anu.edu.jo',
    about:
        'د. سامر محمود أحمد الزعبي، أستاذ ورئيس قسم اللغة الانجليزية في جامعة عجلون الوطنية. حاصل على دكتوراه في اللغة الإنجليزية والتطبيقية من جامعة بحر الأحمر في السودان وماجستير في اللغة الإنجليزية / المناهج والتعليم من جامعة الفاشر في السودان. خبرة تدريسية واسعة في مجال تدريس اللغة الإنجليزية في العديد من المدارس والجامعات. يتخصص في تعليم اللغة الإنجليزية، ولديه القدرة على تدريس مجموعة متنوعة من المواضيع اللغوية.',
  ),
  CollegeOfLiterature(
    phone: '+962786675937',
    image: 'assets/images/Literature/amenlmaisah.jpg',
    title: 'د. امين الخمايسة',
    education: 'أدب',
    email: 'azmkhk@yahoo.com',
    about:
        'أمين زهير محمد الخمايسة، أستاذ مساعد في جامعة عجلون الوطنية، متخصص في الأدب الإنجليزي. حاصل على درجات ممتازة في الثانوية العامة والبكالوريوس والماجستير والدكتوراه من جامعة اليرموك. خبرة تدريسية واسعة في الجامعات الأردنية. يعمل حاليًا في جامعة عجلون الوطنية وسبق له العمل كمدرس مساعد في جامعة اليرموك. قام بتحسين مكتبة الجامعة وتنظيم العديد من المحاضرات والجلسات الامتحانية. كما عمل كمستشار للطلاب ومعلم في المدارس الحكومية لمدة تسع سنوات.',
  ),
  CollegeOfLiterature(
    phone: '+962786479293',
    image: 'assets/images/anu.jpg',
    title: 'د. محمد الروسان',
    education: 'اللغة الانجليزية',
    email: 'Dr.mohammad-alrousan@anu.edu.jo',
    about:
        ' د. محمد الروسان, فرد متحفز وموجه ذاتياً، خبرة 2 عامًا في تدريس اللغة الإنجليزية واللغويات. متمكن في تنظيم بيئة الصف لتسهيل التعلم. مهارات اتصال ممتازة ومهارات فنية قوية. فكّاهي في التفكير النقدي والقدرة على حل المشكلات بالإبداع. يستمتع بالعمل ضمن فريق ويتميز في بيئات العمل التحديّة. متميز بالتفاني والحماس والإخلاص. حاصل على دكتوراه في اللغويات وماجستير في اللغة الإنجليزية، مع خبرة تدريسية واسعة.',
  ),
  CollegeOfLiterature(
    phone: '+962779405400',
    image: 'assets/images/Literature/mahmoudalsobh.jpg',
    title: 'أ.د. محمود الصبح',
    education: 'مناهج اللغة الانجليزية',
    email: 'Sobh_mohad@yahoo.com',
    about:
        'الدكتور محمود علي محمد الصبح، حاصل على دكتوراه في اللغة الإنجليزية ومناهجها وأساليب تدريسها من جامعة اليرموك في الأردن عام 2010، وماجستير في مناهج اللغة الإنجليزية وأساليب تدريسها عام 1999. لديه خبرة تدريسية واسعة، حيث عمل كعضو هيئة تدريس في جامعة عجلون الوطنية منذ عام 2012، وشغل منصب رئيس قسم اللغة الإنجليزية وآدابها في الجامعة من عام 2012 إلى 2015، بالإضافة إلى العديد من الخبرات الأخرى في التدريس والإشراف التربوي.',
  ),
  CollegeOfLiterature(
    phone: '+962792892657',
    image: 'assets/images/anu.jpg',
    title: 'م.رانيا الشرايري',
    education: 'اللغة الانجليزية/ ترجمة',
    email: 'raniaalsharairi@gmail.com',
    about:
        'م. رانيا الشرايري معلمة في American University Schools of Middle East منذ يوليو ٢٠١٦. خبرة في تدريس اللغة الإنجليزية للطلاب في المراحل الابتدائية، المتوسطة، والثانوية (تدريس منزلي). حاصل على درجة البكالوريوس والماجستير في برنامج الترجمة من جامعة اليرموك. متحصل على شهادات وتأهيلات متنوعة، بما في ذلك اجتياز اختبار TOEFL وحضور ورش عمل في مجالات متعددة. يجيد اللغة العربية والإنجليزية. يتميز بإدارة فصول دراسية جيدة ومهارات اتصال ممتازة ومهارات عمل جماعي متميزة. يعمل أيضًا كمساعد مدير ومترجم حر.',
  ),
  CollegeOfLiterature(
    phone: '+962777463940',
    image: 'assets/images/Literature/khakedaljabli.jpg',
    title: 'د. خالد الجبالي',
    education: 'تاريخ اسلامي',
    email: 'jabali1966@yahoo.com',
    about:
        'خالد حسن الجبالي، أستاذ مساعد في بجامعة عجلون الوطنية، حاصل على دكتوراه وماجستير في التاريخ الإسلامي. لديه خبرة تدريسية واسعة، ومهتم بالتاريخ الإسلامي والدراسات الاجتماعية.',
  ),
  CollegeOfLiterature(
    phone: '+962778919374',
    image: 'assets/images/Literature/mohamedalamirah.jpg',
    title: 'د.محمد سالم عمايرة',
    education: 'تاريخ حديث ومعاصر',
    email: 'dr.amyerh@yahoo.com',
    about:
        'د.محمد سالم عمايرة، أستاذ متميّز في التاريخ، حاصل على درجة الدكتوراه في التاريخ الحديث والمعاصر من الجامعة الاردنية. لديه خبرة تدريسية طويلة ومتنوعة في مدارس وجامعات عدة، ومنها جامعة جازان، حيث عمل كأستاذ مساعد لسنوات عدة.',
  ),
  CollegeOfLiterature(
    phone: '+962779082013',
    image: 'assets/images/Literature/khaledshraidah.jpg',
    title: 'د. خالد شريدة',
    education: 'تاريخ اسلامي',
    email: 'dr.khaled1965@yahoo.com',
    about:
        'د. خالد سليمان حمد شريده، حاصل على درجة الدكتوراه والماجستير من الجامعة الأردنية، وبكالوريوس من جامعة اليرموك. لديه خبرة تدريسية في التربية بالأردن والإمارات، ويعمل حاليًا كأستاذ مساعد في جامعتي جدارا وعجلون الوطنية بالأردن.',
  ),
  CollegeOfLiterature(
    phone: '+962776494880',
    image: 'assets/images/Literature/ahmedalqudah.jpg',
    title: 'أ.د أحمد القضاة',
    education: 'تاريخ حديث ومعاصر',
    email: 'ah.alqudah@anu.edu.jo',
    about:
        'أ.د. أحمد حامد إبراهيم القضاة، أستاذ تاريخ في جامعة عجلون الوطنية، حاصل على درجة الدكتوراه في التاريخ الحديث والمعاصر. لديه خبرة تدريسية في الجامعات الأردنية والسعودية، وقد فاز بجوائز علمية مرموقة.',
  ),
  CollegeOfLiterature(
    phone: '+962772216908',
    image: 'assets/images/Literature/alialobdi.jpg',
    title: 'م.علي أحمد العبدي',
    education: 'اللغة العربية',
    email: 'alialnawateer@yahoo.com',
    about:
        'أ. علي أحمد العبدي ، أستاذ في جامعة عجلون الوطنية، عضو في رابطة الكتاب الأردنيين، ومشارك في تقديم المواعظ مع وزارة الأوقاف. له تسعة مؤلفات منشورة وعمل كمعلم في السعودية والإمارات.',
  ),
  CollegeOfLiterature(
    phone: '+962790459080',
    image: 'assets/images/anu.jpg',
    title: 'د. عبير الغزو',
    education: 'مناهج اللغة الانجليزية',
    email: 'fares.Abeer@yahoo.com',
    about:
        'د. عبير الغزو, تهتم بالقراءة والترجمة. لديها اتقان في اللغة العربية والإنجليزية وقد أخذت بعض الدورات في الفرنسية. حاصلة على درجة البكالوريوس في اللغة الإنجليزية وآدابها، ودرجة الماجستير في تدريس اللغة الإنجليزية كلغة أجنبية، ودرجة الدكتوراه في نفس التخصص.',
  ),
  CollegeOfLiterature(
      phone: '+962798450401',
      image: 'assets/images/anu.jpg',
      title: 'د.عوض الدويري',
      education: 'الدعوة واصول الدين',
      email: 'awaddwere999@gmail.com',
      about: 'د.عوض الدويري, حاصل على درجة الدكتوراه في الحديث الشريف في حامعه اليرموك. وماجستير في الحديث الشريف في الجامعة الاردينة عام 2015, وبكالوريوس في الدعوه واصول الدين من وزارة الاواقاف والشؤون والمقدسات الاسلامية عام 1997.',),
];
