class CollegeOfLaw {
  final String image;
  final String title;
  final String education;
  final String email;
  final String about;
  final String phone;

  CollegeOfLaw({
    required this.phone,
    required this.image,
    required this.title,
    required this.education,
    required this.email,
    required this.about,
  });
}

final softDocs = [
  CollegeOfLaw(
    phone: '+962795639170',
    image: 'assets/images/Law/mohamedfreihat.jpg',
    title: 'د.محمد الفريحات',
    education: 'القانون الخاص',
    email: 'Friehat_a@hotmail.com',
    about:
        'محمد شفيق يوسف الفريحات، رئيس قسم القانون حاصل على دكتوراه في القانون الخاص، متخصص في القانون المدني، يعمل كمحاضر غير متفرغ في عدة جامعات أردنية، وهو أيضًا عضو في نقابة المحامين، ويجيد اللغتين العربية والإنجليزية.',
  ),
  CollegeOfLaw(
    phone: '+962772367539',
    image: 'assets/images/Law/ahmedbtoush.jpg',
    title: 'د.أحمد البطوش',
    education: 'القانون الخاص',
    email: 'Btoosh127@gmail.com',
    about:
        'الدكتور أحمد فهد البطوش، أستاذ مساعد في جامعة عجلون الوطنية. حاصل على درجة البكالوريوس في القانون من جامعة مؤتة، ودرجة الماجستير في القانون التجاري من جامعة اليرموك، ودكتوراه في القانون الخاص (تجاري) من جامعة العلوم الإسلامية. له أبحاث منشورة ومقبولة للنشر، ويشارك في اللجان الأكاديمية والمجتمعية.',
  ),
  CollegeOfLaw(
    phone: '+962775175883',
    image: 'assets/images/Law/mohamedbanymekdad.jpg',
    title: 'د.محمد بني مقداد',
    education: 'القانون الخاص',
    email: 'm_sh_1965@windowslive.com',
    about:
        'محمد علي محمد بني مقداد، أستاذ مشارك في القانون الخاص (المدني والتجاري)، أردني ومتزوج. حاصل على درجة الدكتوراه في القانون الخاص والتجاري من مصر، ودرجة الماجستير من السودان، وبكالوريوس في الحقوق من جامعة جرش في الأردن. له العديد من الكتب العلمية في نفس المجال.',
  ),
  CollegeOfLaw(
    phone: '+962791439702',
    image: 'assets/images/Law/talalalesa.jpg',
    title: 'أ.د.طلال العيسى',
    education: 'القانون الدولي',
    email: 'talalaleissa1@yahoo.com',
    about:
        'الدكتور طلال ياسين عبدالله العيسى، حاصل على درجة البكالوريوس في القانون من جامعة البصرة، ودرجة الماجستير والدكتوراه في القانون من جامعة بابل. يمتلك خبرة واسعة في العمل الأكاديمي والبحثي، حيث شغل عدة مناصب في الجامعات في العراق وخارجه.',
  ),
  CollegeOfLaw(
    phone: '+962796140063',
    image: 'assets/images/Law/essalafismadi.jpg',
    title: 'د.عيسى لافي الصمادي',
    education: 'القانون الخاص',
    email: 'essa.smadi68@yahoo.com',
    about:
        'د. عيسى الفي حسن الصمادي، حاصل على دكتوراه في القانون الخاص، يعمل حاليًا كاستاذ مساعد في كلية الحقوق بجامعة عجلون الوطنية. لديه خبرة في العمل بوزارة التربية والتعليم، حيث شغل عدة مناصب منها مدير مديرية التأسيس والترخيص ورئيس قسم بعثات الموظفين، وحاصل على شهادة خبير إداري تربوي.',
  ),
  CollegeOfLaw(
    phone: '',
    image: 'assets/images/Law/zyadalwashat.jpg',
    title: 'د.زياد محمد الوحشات',
    education: 'القانون',
    email: '',
    about: '',
  ),
  CollegeOfLaw(
    phone: '+962790082171',
    image: 'assets/images/Law/muntaseralqudah.jpg',
    title: 'د.منتصر احمد القضاة',
    education: 'القانون الخاص',
    email: 'm74qudah @yahoo.com',
    about:
        'المحامي الدكتور منتصر احمد مفلح القضاة، حاصل على دكتوراه في القانون الخاص، ويعمل حاليًا كاستاذ مشارك في كلية الحقوق بجامعة عجلون الوطنية. لديه خبرة في العمل بوزارة التربية والتعليم، حيث شغل عدة مناصب بما في ذلك عميد شؤون الطلبة وعميد كلية الحقوق. يتميز بخبرة واسعة في التدريس والإشراف الأكاديمي، وكان رئيسًا للعديد من المجالس واللجان الجامعية.',
  ),
  CollegeOfLaw(
    phone: '+962795927972',
    image: 'assets/images/Law/drhashembls.jpg',
    title: 'د. هاشم بلص',
    education: 'قانون عام',
    email: 'hashembalas@gmail.com',
    about:
        'د. هاشم بلص, حاصل على درجة البكالوريوس من جامعة اربد, ودرجة الماجيستير من جامعة جدارا, ودرجة الدكتوراه في جامعة العلوم الاسلامية وهو استاذ مساعد في كلية القانون في جامعة عجلون الوطنية.',
  ),
  CollegeOfLaw(
    phone: '+962772309194',
    image: 'assets/images/Law/ahmedalamawi.jpg',
    title: 'د. أحمد عماوي',
    education: 'قانون جنائي',
    email: 'amawialaa@yahoo.com',
    about:
        'أحمد علي العماوي، يحمل دكتوراه في القانون العام، وماجستير في القانون التجاري، وبكالوريوس في الحقوق، ودبلوم في العلوم الشرطية. حاصل على عدة جوائز تقديرية من بينها ميدالية الحسين للتفوق ووسام حفظ السلام الأردني.',
  ),
  CollegeOfLaw(
    phone: '',
    image: 'assets/images/Law/galebalsmailah.jpg',
    title: 'د. غالب الشمايلة',
    education: 'قانون دستوري',
    email: 'gh.alshamaylh@gmail.com',
    about:
        'د. غالب الشمايلة، محام وأستاذ مساعد في كلية الحقوق بجامعة عجلون الوطنية، له دكتوراه في فلسفة القانون العام. يعمل كممثل للجامعة في الحملة الوطنية لتعزيز المشاركة الوطنية ويشغل عدة مهام إدارية وأكاديمية داخل الكلية.',
  ),
  CollegeOfLaw(
    phone: '+96277965452',
    image: 'assets/images/Law/salemalsawli.jpg',
    title: 'د. سليم العسولي',
    education: 'قانون اداري',
    email: 'saleemasouli@gmail.com',
    about:
        'سليم عبد الرحمن سليم العسولي، خبير في القانون، حاصل على دكتوراه في القانون العام وماجستير في القانون الإداري، ويعمل كأستاذ مساعد في جامعة عجلون الوطنية. يتمتع بمهارات تقنية ولغوية ممتازة، ويتمتع بالقدرة على العمل في فريق وتحمل الضغوط.',
  ),
  CollegeOfLaw(
    phone: '+962777292918',
    image: 'assets/images/Law/dr.mamoonsmadi.jpg',
    title: 'د. مأمون الصمادي',
    education: 'القانون المدني',
    email: 'MAMOONALSMADI@YAHOO.COM',
    about:
        'مأمون سليمان داوود الصمادي، محامٍ متخصص في قضايا التعويضات والضرر، حاصل على درجة الدكتوراه في القانون المدني من جامعة القاهرة بتقدير ممتاز، وماجستير في القانون الخاص من جامعة جرش بتقدير جيد جداً. يعمل كمحامٍ ومستشار قانوني في عدة مجالات، وله خبرة في التدريس والمشاركة في الأنشطة الاجتماعية والمؤتمرات القانونية.',
  ),
  CollegeOfLaw(
    phone: '+962772038687',
    image: 'assets/images/Law/dr-tafweg.jpg',
    title: 'د. توفيق الخشاشنة',
    education: 'القانون الجنائي',
    email: 't_khashashneh@yahoo.com',
    about:
        'توفيق عبدالله أحمد الخشاشنة، استاذ مساعد في كلية الحقوق بجامعة عجلون الوطنية، حاصل على درجة الدكتوراه في القانون الجنائي من جامعة عين شمس بمصر، ودرجة الماجستير في عدالة جنائية من جامعة مؤتة بالأردن. يحمل بكالوريوس علوم قانونية وشرطية من جامعة مؤتة وشهادة في المحاماة من نقابة المحامين الأردنيين.',
  ),
  CollegeOfLaw(
      phone: '+962776981350',
      image: 'assets/images/anu.jpg',
      title: 'د.شيماء خضر الحسين',
      education: 'القانون المدني',
      email: 's.alhussien@anu.edu.jo',
      about: 'الدكتورة شيماء محمد سعيد خضر الحسين، حاصلة على درجة الدكتوراه في القانون الخاص (القانون المدني) ودرجة الدكتوراه في القانون الجنائي، وكلتاهما بتقدير امتياز. لديها خبرة تدريسية في عدة جامعات في الأردن والعراق، بالإضافة إلى عضويتها في نقابة المحامين العراقيين منذ عام 1998.',
  ),
];
