class CollegeOfWorks {
  final String image;
  final String title;
  final String education;
  final String email;
  final String about;
  final String phone;

  CollegeOfWorks({
    required this.phone,
    required this.image,
    required this.title,
    required this.education,
    required this.email,
    required this.about,
  });
}

final softDocs = [
  CollegeOfWorks(
    phone: '343',
    image: 'assets/images/works/nedalalqudah.jpg',
    title: 'د.نضال القضاة',
    education: 'ادارة الاعمال',
    email: 'naq682002@hotmail.com',
    about:
        'نضال فواز حسين القضاه، رئيس قسم إدارة الأعمال حاصل على درجة الدكتوراه في إدارة الأعمال من جامعة Harbin Institute of Technology في الصين في 2019، ولديه ماجستير وبكالوريوس في إدارة الأعمال من جامعات في العراق.',
  ),
  CollegeOfWorks(
    phone: '346',
    image: 'assets/images/works/heshamshantawi.jpg',
    title: 'د.هشام شطناوي',
    education: 'ادارة الاعمال',
    email: 'Shatnawi_Hisham@yahoo.com',
    about:
        'هشام علي طه شطناوي،  يعمل كأستاذ مشارك في جامعة عجلون الوطنية منذ عام 2013. لديه دكتوراه في إدارة الأعمال من جامعة الجنان في لبنان وماجستير في نفس التخصص، وبكالوريوس في العلوم المالية والمصرفية من جامعة اليرموك.',
  ),
  CollegeOfWorks(
    phone: '332',
    image: 'assets/images/works/belalmatani.jpg',
    title: 'د. بلال متاني',
    education: 'ادارة أعمال',
    email: 'd_bilal_m@yahoo.com',
    about:
        'أحمد عبد القادر متاني، حاصل على دكتوراه في إدارة الأعمال من جامعة أم درمان الإسلامية في السودان بتقدير امتياز، وماجستير في إدارة الأعمال من الأكاديمية العربية للعلوم المالية والمصرفية في عمان بتقدير جد جدا، وبكالوريوس في إدارة الأعمال من جامعة جوبا في السودان بتقدير امتياز. لديه أيضًا دبلوم في صحة عامة من معهد مهن الطبية في إربد  يعمل كأستاذ مساعد في قسم إدارة الأعمال في جامعة عجلون الوطنية.',
  ),
  CollegeOfWorks(
    phone: 'لا يوجد',
    image: 'assets/images/anu.jpg',
    title: 'د.رؤى الربابعة',
    education: 'ادارة الاعمال',
    email: 'Nour.rowa@hotmail.com',
    about:
        'رؤى عدنان مصطفى الربابعة، حاصلة على دكتوراه في إدارة الأعمال متخصصة في إدارة العمليات والإنتاج. قامت بدراسة تأثير تنفيذ نظام الإنتاج النحيف على الأداء التشغيلي. بالإضافة إلى ذلك، حصلت على درجة الماجستير في إدارة العمليات وبكالوريوس في إدارة الأعمال، ولديها خلفية في تعليم الحاسوب.',
  ),
  CollegeOfWorks(
    phone: '361',
    image: 'assets/images/anu.jpg',
    title: 'د.احمد البدور',
    education: 'ادارة الاعمال',
    email: 'ahmedalbdour84@gmail.com',
    about:
        'أحمد وصفي البدور حاصل على درجة الماجستير في التسويق ودكتوراه في إدارة الأعمال، مع خبرة تزيد عن 10 سنوات في مجالات الإدارة والتسويق. عمل كمدرب ومسؤول تسويق في شركة القدس، وكذلك مدير منطقة أمامية في مركز تجاري. لديه مهارات تواصل ممتازة وقدرة على حل المشكلات، ويتمتع بمرونة في التعامل مع البيئات السريعة التغيير.',
  ),
  CollegeOfWorks(
    phone: '304',
    image: 'assets/images/works/muhanedalebini.jpg',
    title: 'د. مهند العبيني',
    education: 'محاسبة',
    email: 'Mohebinni@yahoo.Com',
    about:
        'مهند محمد موسى العبيني، رئيس قسم المحاسبة حاصل على دكتوراه في محاسبة من جامعة عمان العربية، ماجستير وبكالوريوس في المحاسبة من جامعة آل البيت. لديه خبرة في مجال المحاسبة والتدقيق الضريبي في عدة منظمات ودوائر حكومية.',
  ),
  CollegeOfWorks(
    phone: '388',
    image: 'assets/images/anu.jpg',
    title: 'د.أحمد كراجة',
    education: 'محاسبة',
    email: 'ahmad_kar1987@yahoo.com',
    about:
        'أحمد إبراهيم كراجة، حاصل على دكتوراه في إدارة الحسابات من جامعة تكنولوجيا بتروناس في ماليزيا، ولديه درجة الماجستير في المحاسبة من الجامعة الأردنية وبكالوريوس في المحاسبة وتكنولوجيا المعلومات من جامعة الحسين بن طلال. شارك في دورات تدريبية في تحليل التقارير المالية وتحليل البيانات اللوحية وغيرها.',
  ),
  CollegeOfWorks(
    phone: '409',
    image: 'assets/images/works/laithaleryan.jpg',
    title: 'د.ليث العريان',
    education: 'محاسبة',
    email: 'laitharyan@yahoo.com',
    about:
        'د.ليث عبدالله محمد العريان، حاصل على دكتوراه في المحاسبة، ماجستير في المحاسبة، وبكالوريوس في المحاسبة. قام بدورات تدريبية في قوانين الضمان الاجتماعي والعمل والبنوك وبرامج الحسابات.',
  ),
  CollegeOfWorks(
    phone: '392',
    image: 'assets/images/works/dralialzubi.jpg',
    title: '.أ.د. علي الزعبي',
    education: 'محاسبة',
    email: 'd_aaaz@yahoo.com',
    about:
        'علي عبدالله  الزعبي، أستاذ دكتور في المحاسبة وعميد كلية إدارة الأعمال في جامعة عجلون الوطنية بالأردن، حاصل على درجة الدكتوراه والماجستير في المحاسبة، وبكالوريوس في المحاسبة. عمل سابقًا كمدرس وأستاذ مساعد في جامعات مختلفة قبل انضمامه إلى جامعة عجلون الوطنية.',
  ),
  CollegeOfWorks(
    phone: '333',
    image: 'assets/images/anu.jpg',
    title: 'تيسير المومني',
    education: 'محاسبة',
    email: 'momani555@yahoo.com',
    about:
        'تيسير علي خلف المومني، حاصل على مؤهلات علمية في مجال المحاسبة، بما في ذلك شهادة الدكتوراه. لديه خبرة في التعليم لمدة 25 عامًا وعمل كمدير مدرسة ومدرس لمادة المحاسبة والرياضيات. يحمل العديد من الشهادات الإضافية في مجالات مختلفة مثل الحاسوب والتدريب التعليمي.',
  ),
  CollegeOfWorks(
    phone: '388',
    image: 'assets/images/anu.jpg',
    title: 'د.مأمون القضاة',
    education: 'محاسبة',
    email: 'dr.mamounalqudah@yahoo.com',
    about:
        'د. مأمون محمد أحمد القضاة، أستاذ مشارك في المحاسبة، حاصل على درجة الدكتوراه في المحاسبة من جامعة عمان العربية في عام 2009، وعمل سابقاً كأستاذ جامعي في جامعة جرش.',
  ),
  CollegeOfWorks(
    phone: '393',
    image: 'assets/images/works/mohaidenabohol.jpg',
    title: 'أ.د. محي الدين أبو الهول',
    education: 'اقتصاد ومصارف إسلامية',
    email: 'mohyii@yahoo.com',
    about:
        'محي الدين يعقوب أبو الهول، رئيس قسم تكنولوجيا المالية والمصرفية متخصص في الشريعة والمصارف الإسلامية، حاصل على درجة الدكتوراه من الجامعة الوطنية الماليزية في تقييم أعمال البنوك الإسلامية، لديه ماجستير من جامعة آل البيت وبكالوريوس من جامعة اليرموك، له خبرة في التدريس والبحث في جامعات الأردن.',
  ),
  CollegeOfWorks(
    phone: 'لا يوجد',
    image: 'assets/images/works/khaledalomari.jpg',
    title: 'د.خالد العمري',
    education: 'التكنولوجيا مالية',
    email: 'Dr.khalidalomari@hotmail.com',
    about:
        'د. خالد العمري هو أستاذ مساعد في جامعة عجلون الوطنية منذ عام 2022، متخصص في التكنولوجيا المالية. حاصل على درجة الدكتوراه في التمويل وتكنولوجيا التمويل، ودرجة الماجستير في التمويل والبنوك، ودرجة البكالوريوس في إدارة الأعمال. يعمل أيضًا كمحاضر جزئي في جامعة البلقاء التطبيقية وجامعة الشعب ومنظمة إنجاز، حيث يركز على مهارات الاتصال وبرامج قيادة المجتمع.',
  ),
  CollegeOfWorks(
    phone: '394',
    image: 'assets/images/works/jorjshwakfah.jpg',
    title: 'د.جورج شواقفه',
    education: 'تمويل',
    email: 'georgenasser80@gmail.com',
    about:
        'الدكتور جورج ناصر شواقفة أكاديمي  متخصص في التمويل والاقتصاد. حاصل على الدكتوراه والماجستير في التجارة من الهند، وعلى البكالوريوس في الآداب أيضًا من الهند. لديه خبرة تدريسية في عدة جامعات أردنية وقام بتدريس مواد في مجالات العلوم المالية والمصرفية والتحليل المالي وإدارة الاستثمار وغيرها.',
  ),
  CollegeOfWorks(
    phone: '352',
    image: 'assets/images/works/mohamedjradat.jpg',
    title: 'ا.د.محمد جرادات',
    education: 'اقتصاديات المال والأعمال',
    email: 'moh_jar@hotmail.com',
    about:
        'د. محمد جرادات، أستاذ مشارك في التمويل والاقتصاد،  لديه دكتوراه في التمويل والاقتصاديات الأعمال من الهند، وخبرة تدريسية في الجامعات في الأردن والسعودية.',
  ),
  CollegeOfWorks(
    phone: '334',
    image: 'assets/images/works/mohamedalmomani.jpg',
    title: 'د. محمد المومني',
    education: 'اقتصاد ومصارف إسلامية',
    email: 'momani_60@yahoo.com',
    about:
        'الدكتور محمد عبد الكريم محمد المومني، أستاذ مشارك، حاصل على درجة الدكتوراه في التمويل والممارسات الاقتصادية الإسلامية، وعلى درجة الماجستير في علوم المالية والمصرفية الإسلامية، وعلى درجة البكالوريوس في إدارة الأعمال. له خبرة تدريسية في العديد من الجامعات الأردنية، حيث شغل مناصب مختلفة في جامعة عجلون الوطنية.',
  ),
  CollegeOfWorks(
    phone: '391',
    image: 'assets/images/works/mohamed_alqudah.jpg',
    title: 'د.محمد طعمه القضاة',
    education: 'الفقه وأصوله',
    email: 'MOHAMMADQUDAH955@YAHOO.COM',
    about:
        'الدكتور محمد طعمة القضاة، أستاذ مشارك, لديه خبرة تدريسية واسعة في مجالات القانون والتعليم. حاصل على درجة الدكتوراه في الفقه وأصوله من جامعة اليرموك، ودرجة الماجستير في الفقه والتشريع من الجامعة الأردنية، ودبلوم عالي في الأساليب العامة من جامعة اليرموك. لديه خبرة عملية في التدريس في عدة جامعات، وعمل كمدير للعلاقات العامة في وزارة الأوقاف. كما شارك في العديد من المؤتمرات والندوات الوطنية والدولية، وكان عضوًا في مجلس النواب الأردني.',
  ),
  CollegeOfWorks(
    phone: 'لا يوجد',
    image: 'assets/images/works/mohamed_alzhoul.jpg',
    title: 'د.محمد حسين الزغول',
    education: 'مصارف اسلامية',
    email: 'mhz1963@yahoo.com',
    about:
        'الدكتور د.محمد حسين الزغول حاصل على درجة الدكتوراه في اقتصاد ومصارف إسلامية وماجستير في نفس التخصص، بالإضافة إلى بكالوريوس في الشريعة. حصل أيضًا على شهادة التوفل وشارك في دورات تدريبية متعددة في مجالات مثل التدقيق الشرعي والمحاسبة المالية الإسلامية.',
  ),
  CollegeOfWorks(
    phone: '390',
    image: 'assets/images/anu.jpg',
    title: 'د. شيرين العلي',
    education: 'مصارف اسلامية',
    email: 'shireen_1984@yahoo.com',
    about:
        'د. شيرين العلي, حاصل على دكتوراه في المصارف الإسلامية، ماجستير في إدارة الأعمال، وبكالوريوس في علوم البنوك والمالية. لديه خبرة كمدير مالي وإداري لمدة 6 أشهر، ويعمل أيضًا كمحاضر جزئي في الجامعة منذ عام 2010. سبق له العمل في شركة تأمين وتدريب لمدة 6 أشهر أيضًا.',
  ),
  CollegeOfWorks(
    phone: '361',
    image: 'assets/images/works/kasemabued.jpg',
    title: 'د. قاسم أبو عيد',
    education: 'علوم مالية ومصرفية',
    email: 'qabueid.qa@gmail.com',
    about:
        'د. قاسم أبو عيد حاصل على درجة الدكتوراه في إدارة المصارف والمالية الإسلامية، ولديه ماجستير في الاقتصاد وبكالوريوس في علوم الإدارة. يعمل حالياً كأستاذ مساعد في جامعة عجلون الوطنية منذ عام 2018، ويدرّس مواد المصارف الإسلامية والمحاسبة الإسلامية، كما يشرف على رسائل الماجستير ويشارك في الأنشطة الأكاديمية. كان رئيس قسم البنوك الإسلامية لمدة عامين، وهو عضو في العديد من اللجان الأكاديمية.',
  ),
  CollegeOfWorks(
    phone: '307 ',
    image: 'assets/images/works/khaleddebat.jpg',
    title: 'د. خالد الذيابات',
    education: 'نظم معلومات إدارية',
    email: 'khaledmis@yahoo.com',
    about:
        'خالد محمد مفلح الديابات، درس إدارة المعلومات في جامعة اليرموك وحصل على ماجستير من جامعة جنان في لبنان ودكتوراه من نفس الجامعة. عمل كمحاضر في جامعة عجلون الوطنية، ثم أصبح أستاذ مساعد ومشارك. يدير أيضًا شركة للنقل البري.',
  ),
  CollegeOfWorks(
    phone: 'لا يوجد',
    image: 'assets/images/anu.jpg',
    title: 'د.فراس الوحشة',
    education: 'education',
    email: 'm85gh@yahoo.com',
    about:
        'د.فراس الوحشة, حاصل على دكتوراه في نظم معلومات الإدارة من جامعة العلوم بماليزيا، ماجستير في نظم معلومات الإدارة من جامعة العلوم والمصارف بعمان، وبكالوريوس في نظم معلومات الإدارة من جامعة البلقاء التطبيقية. لديه خبرة في التدريس والتدريب، بما في ذلك تدريس دورات الـ ICDL والمشاركة في التدريس في عدة جامعات، بالإضافة إلى تجربة في الإدارة كمدير عام لشركة نقل الأراضي.',
  ),
  CollegeOfWorks(
    phone: '309',
    image: 'assets/images/works/qadro_ashukri.jpg',
    title: 'د.قدري الشكري',
    education: 'نظم معلومات ادارية',
    email: 'Kadri_njah@yahoo.com',
    about:
        'د. قدري سليمان الشكري، حاصل على دكتوراه في نظم المعلومات الإدارية، ماجستير في نفس التخصص، وبكالوريوس في التربية. يعمل كمحاضر في جامعة عجلون الوطنية ومدير مركز الاستشارات وخدمة المجتمع، ولديه خبرة في الهيئات الإدارية بمحافظة إربد.',
  ),
  CollegeOfWorks(
      phone: '348',
      image: 'assets/images/works/hasenalwhshat.jpg',
      title: 'د.حسن محمد الوحشات',
      education: 'تقنية معلومات',
      email: 'hasanwahshat28@yahoo.com',
      about: 'حسن محمد الوحشات، وحاصل على درجة الدكتوراه في التقنيات / علوم المعلومات والأتمتة، ودرجة الماجستير في الاتصالات الكهربائية التلقائية. يتخصص في تقنية المعلومات وإدارة مشاريع البرمجيات وأنظمة المعلومات الإدارية. لديه خبرة تدريسية واسعة في الجامعات في ليبيا والأردن، ويجيد اللغة العربية والروسية والإنجليزية.',
  ),
];
