class SoftwareDocsModel {
  final String image;
  final String title;
  final String education;
  final String email;
  final String about;
  final String phone;

  SoftwareDocsModel({
    required this.phone,
    required this.image,
    required this.title,
    required this.education,
    required this.email,
    required this.about,
  });
}

final softDocs = [
  SoftwareDocsModel(
    image: 'assets/images/bajes2.jpg',
    title: 'د. باجس الجنيدي',
    education: 'علم الحاسوب',
    email: 'bajesaljunadei@gmail.com',
    about:
        'د. باجس الجنيدي، عميد كلية تكنلوجيا المعلومات وأستاذ مساعد في هندسة أنظمة الكمبيوتر والمعلوماتية، متخصص في علوم الكمبيوتر من جامعة سانت بطرسبرغ الكهروتقنية. يتمتع بخبرة واسعة في إدارة المشاريع، حل المشكلات المعقدة، والتصميم الإبداعي. شغل مناصب إدارية في جامعة عجلون الوطنية كرئيس قسم وعميد بالإنابة لكلية تكنولوجيا المعلومات. مشارك في أنشطة مهنية متعددة وعضو في نقابة المهندسين الأردنيين. نشر أبحاثًا في مجالات التعرف على الخط العربي، تصنيف البيانات الضخمة، المدينة الذكية، وأمن البيانات في الحوسبة السحابية. لديه خبرة في تدريس مواد متنوعة تشمل أخلاقيات الكمبيوتر وهندسة البرمجيات.',
    phone: '+962 7 9017 5859',
  ),
  SoftwareDocsModel(
    image: 'assets/images/ahmadhasan.jpg',
    title: 'د. أحمد حسن',
    education: 'هندسة البرمجيات',
    email: 'ahmed_hassan@anu.edu.jo',
    about:
        'د. أحمد حسن، أستاذ ورئيس قسم هندسة البرمجيات وأمن المعلومات بجامعة عجلون الوطنية. حاصل على دكتوراه في أمن المعلومات وهندسة البرمجيات من جامعة MEDIU بماليزيا وماجستير في نظم المعلومات الحاسوبية. لديه خبرة تدريسية واسعة في مجال علوم الحاسوب في عدة جامعات، ومشارك في العديد من الأبحاث والمنشورات الدولية. متخصص في أمن المعلومات، الأنظمة المعلوماتية، هندسة البرمجيات، وتطوير البرمجيات. يتقن اللغة العربية والإنجليزية.',
    phone: '+962789430436',
  ),
  SoftwareDocsModel(
    image: 'assets/images/mutasem.jpg',
    title: 'د. معتصم الخصاونة',
    education: 'هندسة البرمجيات',
    email: 'mutasem.alkhasawneh@anu.edu.jo',
    about:
        'د. معتصم شبيب الخصاونة، أستاذ مساعد في قسم هندسة البرمجيات بجامعة عجلون الوطنية. حاصل على دكتوراه في هندسة الكمبيوتر والاتصالات من جامعة العلوم الماليزية وماجستير في الهندسة الحيوية. خبرة واسعة في مجال الهندسة الحيوية والاتصالات بالإضافة إلى تجربة في العمل الإداري والهندسي في الولايات المتحدة. متخصص في الذكاء الاصطناعي، شبكات العصبونات الاصطناعية، وتطبيقات الذكاء الاصطناعي. نشر العديد من الأبحاث في مجالات تخصصه.',
    phone: '+962 7 9214 6363',
  ),
  SoftwareDocsModel(
      phone: '+962788633640',
      image: 'assets/images/amerAboJassar.jpg',
      title: 'د. عامر ابو جسار',
      education: 'علم حاسوب',
      email: 'amer_abu_jassar@hotmail.com',
      about: 'الدكتور عامر تحسين سلامة أبو جسار، دكتور في كلية تكنلوجيا المعلومات في جامعة عجلون الوطنية. حاصل على دكتوراه في أمن المعلومات وهندسة البرمجيات من جامعة MEDIU في ماليزيا، وماجستير في نظم المعلومات الحاسوبية. لديه خبرة واسعة في التدريس في عدة جامعات، ومشارك في العديد من الأبحاث والمنشورات الدولية. متخصص في أمن المعلومات، الأنظمة المعلوماتية، هندسة البرمجيات، وتطوير البرمجيات. يتقن اللغة العربية والإنجليزية.'),
  SoftwareDocsModel(
    image: 'assets/images/zahi.jpg',
    title: 'د. زاهي أبو سرحان',
    education: 'هندسة البرمجيات',
    email: 'zamas.1974@gmail.com',
    about:
        'د. زاهي عبدالله محمد أبو سرحان، أكاديمي ومطور برمجيات متخصص في هندسة الكمبيوتر والمعلوماتية من جامعة خاركوف للراديو إلكترونيات، أوكرانيا. يعمل كمدرب ومطور برمجيات في KTS Jordan وأستاذ مساعد سابق في جامعة العلوم التطبيقية. خبرته تشمل تطوير البرمجيات، الذكاء الاصطناعي، شبكات النيورال، ومعالجة الصور. نشر العديد من الأبحاث في مجالات النظم المعلوماتية وهندسة البرمجيات، ولديه خبرة في تدريس مجموعة واسعة من مقررات علوم الحاسوب والهندسة.',
    phone: '+962 786462775 ',
  ),
  SoftwareDocsModel(
    image: 'assets/images/gazi.jpg',
    title: 'أ.د. غازي الشقاح',
    education: 'هندسة البرمجيات',
    email: 'g.shakah@anu.edu.jo',
    about:
        'د. غازي شكاح، أستاذ مشارك في علوم الحاسوب متخصص في الذكاء الاصطناعي وأنظمة الوكلاء المتعددة. حاصل على الدكتوراه من جامعة الدولة البيلاروسية، مينسك. شغل مناصب أكاديمية وإدارية في جامعة عجلون الوطنية، بما في ذلك رئيس قسم علوم الحاسوب وعميد كلية تكنولوجيا المعلومات. مهتم بالهندسة المعرفية، معالجة الصور، وبحوث العمليات. لديه خبرة تدريسية واسعة في مجموعة متنوعة من مقررات علوم الحاسوب. نشر عدة أبحاث في مجالات تخصصه وحاصل على منح دراسية كاملة للبحث العلمي.',
    phone: '+962 7 7926 7232',
  ),
  SoftwareDocsModel(
    image: 'assets/images/mohamedBaniYounes.jpg',
    title: 'أ.د. محمد بني يونس',
    education: 'علم حاسوب',
    email: 'aliyounes1962@gmail.com',
    about:'د. محمد علي محمد بني يونس، أستاذ مساعد في كلية تكنولوجيا المعلومات بجامعة عجلون الوطنية، حاصل على دكتوراه في علوم الحاسوب من جامعة علوم ماليزيا، وماجستير في علوم الحاسوب من جامعة السودان للعلوم والتكنولوجيا. خبرة تدريسية واسعة في الجامعات، ومشارك في العديد من الأبحاث الدولية. تخصصه في تشفير الصور وأمن المعلومات، ولديه خبرة في تصميم الشبكات وهندسة البرمجيات.',
    phone: '+962782370618',
  ),
  SoftwareDocsModel(
    phone: '+962 7 9660 4891',
    image: 'assets/images/yaserAlsharee.jpg',
    title: 'أ.د. ياسر الشرع',
    education: 'أنظمة ومكونات الحاسوب',
    email: 'dryasser@ukr.net',
    about:
        'د. ياسر محمد عبد الرحيم الشرع، أستاذ مساعد في قسم تكنولوجيا المعلومات بجامعة عجلون الوطنية. حاصل على دكتوراه في علوم الحاسوب من جامعة الطيران الوطنية في أوكرانيا وماجستير في نظم المعلومات الحاسوبية. يتمتع بخبرة واسعة في التدريس والبحث العلمي في عدة جامعات. متخصص في أمن المعلومات، وتطوير البرمجيات، ويتحدث اللغتين العربية والإنجليزية بطلاقة.',
  ),
];
